{
    "app_details": [
        {
            "category": [
                "TOOLS"
            ],
            "content_rating": [
                "Teen",
                "Violence"
            ],
            "current_version": "1.7.4",
            "description": "* Instantly turn your phone into a bright flashlight!\\n* The brightest, fastest, and most handy LED flashlight!\\n* The Flashlight you will never forget to bring when in need!\\n* With the most elegant design and the fastest startup, The Flashlight takes full advantage of the LED light!\\nNote: The Flashlight App need camera permission of your device(flashlight hardware is attached the Camera, for opening the light. It's the reasonable and necessary permission request).\\nFeatures :\\n• The brightest illuminator ever\\n• Fastest startup flashlight\\n• Strobe mode with sensitive frequency controller\\n• Built-in SOS flashlight signal\\n• Intuitive and elegant UI design\\n• Enjoy the cam LED light!\\n* Our Facebook Page:\\nhttps://www.facebook.com/BrightFlashlight\\nhttps://www.facebook.com/FlashlightPro.LED/",
            "description_html": "b\"<b>* Instantly turn your phone into a bright flashlight!</b><br/>* The brightest, fastest, and most handy LED flashlight! <br/>* The Flashlight you will never forget to bring when in need! <br/>* With the most elegant design and the fastest startup, The Flashlight takes full advantage of the LED light!<br/><b>Note: The Flashlight App need camera permission of your device(flashlight hardware is attached the Camera, for opening the light. It's the reasonable and necessary permission request).</b><br/><br/><b>Features :</b><br/>\\xe2\\x80\\xa2 The brightest illuminator ever<br/>\\xe2\\x80\\xa2 Fastest startup flashlight <br/>\\xe2\\x80\\xa2 Strobe mode with sensitive frequency controller<br/>\\xe2\\x80\\xa2 Built-in SOS flashlight signal<br/>\\xe2\\x80\\xa2 Intuitive and elegant UI design<br/>\\xe2\\x80\\xa2 Enjoy the cam LED light!<br/><br/>* Our Facebook Page: <br/>https://www.facebook.com/BrightFlashlight<br/>https://www.facebook.com/FlashlightPro.LED/\"",
            "developer": "Zentertain",
            "developer_address": "HK",
            "developer_email": "Fideoapp@zentertian.net",
            "developer_id": "Zentertain",
            "developer_url": "https://www.facebook.com/BrightFlashlight/",
            "editors_choice": false,
            "free": true,
            "histogram": {
                "1": null,
                "2": null,
                "3": null,
                "4": null,
                "5": null
            },
            "iap": false,
            "iap_range": null,
            "icon": "https://lh3.googleusercontent.com/6ElOZ2Rw3IJQJd6gx5Ck4d2T0Q2hIwbDukI4WhOLi9V5HGqoPKGtYYkpBrU36hqTUw",
            "installs": "10,000,000+",
            "interactive_elements": null,
            "package-name": "com.torch.lampe.flashlight",
            "positives": 0,
            "positives_list": [],
            "price": "0",
            "recent_changes": null,
            "required_android_version": "4.1 and up",
            "reviews": 112422,
            "score": "4.3",
            "screenshots": [
                "https://lh3.googleusercontent.com/vKm_jgugL1uxv2Ptf8LAbDvjyLkKEhy5BtY1WagS-Z1oT2gy3qU83cZq9acZ8NgbVA=w720-h310-rw",
                "https://lh3.googleusercontent.com/VNhIdYCIVpL-6yNw7250noKmt6nU7AuSfiJP5ahJfmGJmA8ocbQn2NHxTzVPMo78Nw=w720-h310-rw",
                "https://lh3.googleusercontent.com/3t-WGUnTX0fqCT2_rP9JQUoaux6kU3D7_DRPfVmX4ZqKe7FD0V0TdndFSvZOy_SLZ1k=w720-h310-rw",
                "https://lh3.googleusercontent.com/D2CB0He5SszH3SpURv9DgnB6dtpzRKhv5thA3dBWxaDMIAoiw0U214pF9eExqciqsxo=w720-h310-rw",
                "https://lh3.googleusercontent.com/Shxspa4_6AqJu4ajyjKU2IM4_92jknd5naA3OAs0_GAIMvi4nWgXaGCyicMSD0k2bLgJ=w720-h310-rw",
                "https://lh3.googleusercontent.com/0oSarjgzP2ObSqMYuZw8YXfNeAO6Huv7jhZ4X28W7PGemQ7quzgEk0LaOkI1ZgWC1lc=w720-h310-rw",
                "https://lh3.googleusercontent.com/EeOeUJFoCUtjf8lMEuy2L30FkpvN171Ow0J-q80fWx-zuFQe_R-0cz2-_rtKCI40dA4=w720-h310-rw",
                "https://lh3.googleusercontent.com/NNfcPRpYz9u-wUblYSdstr8RM13aerzEzMQVvk8uHoTbc4xVZaYnTTKJkzG5T7YjrQM=w720-h310-rw",
                "https://lh3.googleusercontent.com/mvmR_JzBM5TqW9qTa56Zfl04HIBChgIFMNUTKUK7CdVEvIAJ-rL6o9UbJbdPdaxXhQ=w720-h310-rw"
            ],
            "size": "4.4M",
            "title": "Flashlight & LED Torch",
            "updated": "February 17, 2020",
            "url": "https://play.google.com/store/apps/details?id=com.torch.lampe.flashlight",
            "video": null
        },
        {
            "category": [
                "COMMUNICATION"
            ],
            "content_rating": [
                "Everyone"
            ],
            "current_version": "2.20.140",
            "description": "WhatsApp from Facebook\\nWhatsApp Messenger is a FREE messaging app available for Android and other smartphones. WhatsApp uses your phone's Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family. Switch from SMS to WhatsApp to send and receive messages, calls, photos, videos, documents, and Voice Messages.\\nWHY USE WHATSAPP:\\n• NO FEES: WhatsApp uses your phone's Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family, so you don't have to pay for every message or call.* There are no subscription fees to use WhatsApp.\\n• MULTIMEDIA: Send and receive photos, videos, documents, and Voice Messages.\\n• FREE CALLS: Call your friends and family for free with WhatsApp Calling, even if they're in another country.* WhatsApp calls use your phone's Internet connection rather than your cellular plan's voice minutes. (Note: Data charges may apply. Contact your provider for details. Also, you can't access 911 and other emergency service numbers through WhatsApp).\\n• GROUP CHAT: Enjoy group chats with your contacts so you can easily stay in touch with your friends or family.\\n• WHATSAPP WEB: You can also send and receive WhatsApp messages right from your computer's browser.\\n• NO INTERNATIONAL CHARGES: There's no extra charge to send WhatsApp messages internationally. Chat with your friends around the world and avoid international SMS charges.*\\n• SAY NO TO USERNAMES AND PINS: Why bother having to remember yet another username or PIN? WhatsApp works with your phone number, just like SMS, and integrates seamlessly with your phone's existing address book.\\n• ALWAYS LOGGED IN: With WhatsApp, you're always logged in so you don't miss messages. No more confusion about whether you're logged in or logged out.\\n• QUICKLY CONNECT WITH YOUR CONTACTS: Your address book is used to quickly and easily connect you with your contacts who have WhatsApp so there's no need to add hard-to-remember usernames.\\n• OFFLINE MESSAGES: Even if you miss your notifications or turn off your phone, WhatsApp will save your recent messages until the next time you use the app.\\n• AND MUCH MORE: Share your location, exchange contacts, set custom wallpapers and notification sounds, broadcast messages to multiple contacts at once, and more!\\n*Data charges may apply. Contact your provider for details.\\n---------------------------------------------------------\\nWe're always excited to hear from you! If you have any feedback, questions, or concerns, please email us at:\\nandroid-support@whatsapp.com\\nor follow us on twitter:\\nhttp://twitter.com/WhatsApp\\n@WhatsApp\\n---------------------------------------------------------",
            "description_html": "b\"WhatsApp from Facebook<br/><br/>WhatsApp Messenger is a FREE messaging app available for Android and other smartphones. WhatsApp uses your phone's Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family. Switch from SMS to WhatsApp to send and receive messages, calls, photos, videos, documents, and Voice Messages.<br/><br/>WHY USE WHATSAPP:<br/><br/>\\xe2\\x80\\xa2 NO FEES: WhatsApp uses your phone's Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family, so you don't have to pay for every message or call.* There are no subscription fees to use WhatsApp.<br/><br/>\\xe2\\x80\\xa2 MULTIMEDIA: Send and receive photos, videos, documents, and Voice Messages.<br/><br/>\\xe2\\x80\\xa2 FREE CALLS: Call your friends and family for free with WhatsApp Calling, even if they're in another country.* WhatsApp calls use your phone's Internet connection rather than your cellular plan's voice minutes. (Note: Data charges may apply. Contact your provider for details. Also, you can't access 911 and other emergency service numbers through WhatsApp).<br/><br/>\\xe2\\x80\\xa2 GROUP CHAT: Enjoy group chats with your contacts so you can easily stay in touch with your friends or family.<br/><br/>\\xe2\\x80\\xa2 WHATSAPP WEB: You can also send and receive WhatsApp messages right from your computer's browser.<br/><br/>\\xe2\\x80\\xa2 NO INTERNATIONAL CHARGES: There's no extra charge to send WhatsApp messages internationally. Chat with your friends around the world and avoid international SMS charges.*<br/><br/>\\xe2\\x80\\xa2 SAY NO TO USERNAMES AND PINS: Why bother having to remember yet another username or PIN? WhatsApp works with your phone number, just like SMS, and integrates seamlessly with your phone's existing address book.<br/><br/>\\xe2\\x80\\xa2 ALWAYS LOGGED IN: With WhatsApp, you're always logged in so you don't miss messages. No more confusion about whether you're logged in or logged out.<br/><br/>\\xe2\\x80\\xa2 QUICKLY CONNECT WITH YOUR CONTACTS: Your address book is used to quickly and easily connect you with your contacts who have WhatsApp so there's no need to add hard-to-remember usernames.<br/><br/>\\xe2\\x80\\xa2 OFFLINE MESSAGES: Even if you miss your notifications or turn off your phone, WhatsApp will save your recent messages until the next time you use the app.<br/><br/>\\xe2\\x80\\xa2 AND MUCH MORE: Share your location, exchange contacts, set custom wallpapers and notification sounds, broadcast messages to multiple contacts at once, and more!<br/><br/>*Data charges may apply. Contact your provider for details.<br/><br/>--------------------------------------------------------- <br/>We're always excited to hear from you! If you have any feedback, questions, or concerns, please email us at:<br/><br/>android-support@whatsapp.com<br/><br/>or follow us on twitter:<br/><br/>http://twitter.com/WhatsApp<br/>@WhatsApp<br/>---------------------------------------------------------\"",
            "developer": "WhatsApp Inc.",
            "developer_address": "1601 Willow Road\\nMenlo Park, CA 94025",
            "developer_email": "android@support.whatsapp.com",
            "developer_id": "WhatsApp+Inc.",
            "developer_url": "http://www.whatsapp.com/",
            "editors_choice": true,
            "free": true,
            "histogram": {
                "1": null,
                "2": null,
                "3": null,
                "4": null,
                "5": null
            },
            "iap": false,
            "iap_range": null,
            "icon": "https://lh3.googleusercontent.com/bYtqbOcTYOlgc6gqZ2rwb8lptHuwlNE75zYJu6Bn076-hTmvd96HH-6v7S0YUAAJXoJN",
            "installs": "5,000,000,000+",
            "interactive_elements": [
                "Users Interact, Digital Purchases"
            ],
            "package-name": "com.whatsapp",
            "positives": 0,
            "positives_list": [],
            "price": "0",
            "recent_changes": null,
            "required_android_version": "4.0.3 and up",
            "reviews": 111582722,
            "score": "4.3",
            "screenshots": [
                "https://lh3.googleusercontent.com/MMue08byixTw74ST_VkNQDUUJBgVEbjNHDYLhIuHmYhMIMJIp3KjVlnhhqZQOZUtNt8=w720-h310-rw",
                "https://lh3.googleusercontent.com/foFmwvVGIwWWXJIukN7png18lFjFgbw3K7BqIm8G-jsFgSTVtkCa-dDkFApUzbvzIvbe=w720-h310-rw",
                "https://lh3.googleusercontent.com/iLgMXFO5qEPlTffpI21zaoG51AORnfu8NPb_2SdAXYgOYcb-xDOMfCryPhVvGNjoew=w720-h310-rw",
                "https://lh3.googleusercontent.com/ElfUPGX67gv0TNQXuDxQGa5a4BYnLAZIgJJmoNoARvqlLQsKEQcNNWz-J_zqGV5vzQ=w720-h310-rw",
                "https://lh3.googleusercontent.com/wBgVA58O2xncQkksLatHGoNLI8L6o_1ZM8AC3GCScxCyaDOWOvMsMilaj1Scp3kEOIw=w720-h310-rw",
                "https://lh3.googleusercontent.com/nknhZ6--QSyZlohrv72BaPlwO2EHPvGKJY8NNACYY0IY8j4QKYATP6alT1yyMYb-35j9=w720-h310-rw"
            ],
            "size": "Varies with device",
            "title": "WhatsApp Messenger",
            "updated": "May 11, 2020",
            "url": "https://play.google.com/store/apps/details?id=com.whatsapp",
            "video": null
        },
        {
            "HA_positives": null,
            "HA_positives_list": null,
            "HA_threat_score": null,
            "adSupported": true,
            "androidVersion": "4.0",
            "category": [
                "VIDEO_PLAYERS"
            ],
            "comments": [
                "Great! An app that just works like expected with nothing hidden behind. It does exactly what it should. Thank you for that!!",
                "Not working at First time I'm try I'm still waiting if app will download what i need to see maybe app want me rate it first then I will try find it working .. I did like information about how to use it but I don't know why message appear for me .Not Found .I don't know why",
                "I find this app incredibly simple to use. It does what it's supposed to do quickly and accurately. I wish I could pay to have the ads removed.",
                "WORTHLESS, JUST AS OTHERS HAVE SAID!!!! Tried 3 different download attempts, each on 1 of 3 different 60 second or less videos on Tumblr, and all 3 videos which are clearly on my blog, this app responded with a \"Not Found\" message. Well, if it won't do as it claims, how did it get 4.6 stars? I gave it 1 star, only because theres no lower rating. Don't waste your time! I wish I'd have heeded the warnings of others. Save yourself the aggrivation. I have one more word.... UNINSTALLING!!!!",
                "It is incredibly hit and miss with this app. It either downloads in the first two seconds or is stuck on downloading forever.",
                "No download in background. If you exit the app before a download completes it does not let you download the file ever again, even if you delete the incomplete download from the folder. It is fast and has good interface but there is room for improvement.",
                "Needs a way to download multiple files at once. If there's a picture just after a video there is no way to get the video file.",
                "Each downloaded video gives me the error \"can't play video\". Something to do with an unsupported audio codec. I'm using a Samsung note 10+.",
                "Easy to use, but if there is an error in down loading there is no link back to the original video that is trying to download",
                "Does not work. Starts but gets stuck at partway through the download.",
                "This is a very good app. Easy for me to download videos & photos on tumblr. Eventhough, it has ads but not too much. Still functioning as i expected. I hope more features will be added soon, it might be awesome. Thank you Developer!",
                "It does not load for me, at all. I tried to refresh it, reinstalling it and wait for the media to load. But all still doesn't load the video. And I can't even download a single thing.. Hope this will put an end to this bug, fast.",
                "No matter what video I try downloading it just says \"Error!\". If you need a video from tumblr you'll just have to just search the internet for it. If it's not anywhere else on the internet, you're just out of luck.",
                "Works great!! You can sometimes get it to download even if you're tumblr don't show the video.",
                "Gifs and videos won't download properly. Using Galaxy S10+. Paid for premium byt still fails. Looking for an alternative solution.",
                "in the beginning it didn't want to down load, the app had to install or synchronize with the tublr app, as it was later updated,now works okay. still experimenting its compatibility to be ead with most picture apps and video enchancers.. room for improvement..",
                "Pretty good, but sometimes the pics would be downloaded but not show up to the gallery, even if its the same folder i've used before.",
                "Does not fully download video, had to try at less 5 times before it fully downloaded or just gave up.",
                "Tried other tumblr downloaders before and they were loaded with ads and i had to do everything manually. Just tried this app and its clean and when i select it to download it does it all for me!",
                "Great app. Really works no issues.",
                "Downloading very slow and freeze most of the time? Why was very good last time but now a days is something wrong?",
                "Absolutely love this app. Besides the ads that I just ignore and occasional posts that you may have to download more then once it's awesome!!",
                "Great app to download videos from Tumbler. Though the ads are always there.",
                "Did not work for me. Samsung s9 excellent wifi.",
                "The app is acceptable, major issue is that when it doesn't download a video, I need to delete the app and reinstall it again to properly download the video.",
                "I just love this application as it makes it easier to save photos that I can not ordinarily save by other means.",
                "Full screen ads now, downloads always stall. Used to be a good app, but not anymore.",
                "I love looking at the new sites you keep adding . You can't possibly get bored.",
                "Works great until it doesn't. This app desperately needs a \"retry\" option.",
                "It's great, it downloads videos quickly and easily. Very efficient best tumblr downloader I've downloaded",
                "Useful application, works as expected . Keeps it simple but functional.",
                "This app used to work great, now it doesn't download any videos constantly saying error 404,and asks you to log on into your tumbler account.",
                "great App, easy to use and easy to understand, download pics, vids and gifs. great App. 5 Stars for sure",
                "I tried to download 6 different videos and got the same error message each time.",
                "Did the job rightly until now and don't understand why is it not downloading anymore. Maybe there is a limit or what.",
                "Works fine if you can find something to download",
                "Good. but sometimes the download won't work .pls fix this.",
                "Works on most, but there are Tumblr posts that are locked by the \"owner\" which won't download. 5 stars",
                "been awesome but recently very finicky and not recording well.",
                "did not work, only got errors when trying to download videos"
            ],
            "containsAds": true,
            "contentRatingDescription": null,
            "content_rating": [
                "Everyone"
            ],
            "currency": "USD",
            "current_version": "4.1",
            "description": "Tumbload lets you download photos/videos from Tumblr quickly and easily. Any media on tumblr can be download by share link. Just browse to any media (photo or video) in tumblr app, and then tap share, select Tumbload app from the list of apps. Tumbload will now load the media and you can easily download it to your phone and watch it offline.\\nMultiple media from Tumblr\\nIf a post on Tumblr is having multiple pictures or videos, then you will be able to select the media on Tumbload and then download one or all with a single tap.\\nThe media is saved in your root path in folder ’Tumbload’\\nFor any bug issues or updates, please email us: appfry@gmail.com",
            "description_html": "Tumbload lets you download photos/videos from Tumblr quickly and easily. Any media on tumblr can be download by share link. Just browse to any media (photo or video) in tumblr app, and then tap share, select Tumbload app from the list of apps. Tumbload will now load the media and you can easily download it to your phone and watch it offline.<br/><br/>Multiple media from Tumblr<br/>If a post on Tumblr is having multiple pictures or videos, then you will be able to select the media on Tumbload and then download one or all with a single tap.<br/><br/>The media is saved in your root path in folder ’Tumbload’<br/><br/>For any bug issues or updates, please email us: appfry@gmail.com",
            "developer": "One Tap Labs",
            "developer_address": "2102 Sector-2, Faridabad, Haryana, India",
            "developer_email": "appfry@gmail.com",
            "developer_id": "One+Tap+Labs",
            "developer_url": "http://onetap.in",
            "editors_choice": false,
            "free": true,
            "headerImage": "https://lh3.googleusercontent.com/zk_X-Vch21gHKGXwJNKxDQntjtgFrMOvpPlDGmaBGIi5SZTtvNOwhHU_XTxymMnMtHM",
            "histogram": [
                732,
                150,
                330,
                1775,
                10470
            ],
            "iap": true,
            "iap_range": [
                "Everyone"
            ],
            "icon": "https://lh3.googleusercontent.com/_3mo0xEU_3Tc3bQEHcAA4kZ2qoEAKXw3wCy864_wbAy51fbiSrmxX7zekAnrv2rim3Q",
            "installs": "500,000+",
            "interactive_elements": null,
            "opswat_positives_list": [],
            "opswat_result": "No Threat Detected",
            "package-name": "com.appfry.tumbload",
            "price": 0,
            "privacyPolicy": "http://onetap.in/privacypolicy.html",
            "recent_changes": null,
            "released": "Aug 1, 2016",
            "required_android_version": "4.0 and up",
            "reviews": 13459,
            "sale": false,
            "saleTime": null,
            "score": 4.567809,
            "screenshots": [
                "https://lh3.googleusercontent.com/nNzTQjMpOUJw3T2Yp2RcJP3dKNtcOROorijEQCo3-_HTbDJ-d51dnsssBp5SUc4vDMw=w720-h310-rw",
                "https://lh3.googleusercontent.com/Y1OPL0hSoUm5ZM5_3uXgm89jd9ga36pJroeYJuVcWLrlkd4FqByslqAzNcIrXlVo4A=w720-h310-rw",
                "https://lh3.googleusercontent.com/pL-Tu8y9DFNnUDa8DiD05th5LYXNblpErMHX0Dn5npFvoISCmhuW-gnQc4mnsHMNyeE=w720-h310-rw",
                "https://lh3.googleusercontent.com/wBOHSaKmBBvGAHt6t-b_vtg0tXU_fkBxD-03WaeCmzG0mXGTU05pxUwN10m7PcF6nlw=w720-h310-rw"
            ],
            "size": "4.1M",
            "store-availability": [
                "Google Play"
            ],
            "title": "Downloader for Tumblr",
            "updated": "July 17, 2019",
            "url": "https://play.google.com/store/apps/details?id=com.appfry.tumbload",
            "video": "https://www.youtube.com/embed/7L1HGqXrdMQ",
            "vt_positives": 0,
            "vt_positives_list": []
        },
        {
            "HA_positives": null,
            "HA_positives_list": null,
            "HA_threat_score": null,
            "adSupported": null,
            "androidVersion": null,
            "category": null,
            "comments": null,
            "containsAds": null,
            "contentRatingDescription": null,
            "content_rating": null,
            "currency": null,
            "current_version": null,
            "description": null,
            "description_html": null,
            "developer": null,
            "developer_address": null,
            "developer_email": null,
            "developer_id": null,
            "developer_url": null,
            "editors_choice": null,
            "free": null,
            "headerImage": null,
            "histogram": null,
            "iap": null,
            "iap_range": null,
            "icon": null,
            "installs": null,
            "interactive_elements": null,
            "opswat_positives_list": [],
            "opswat_result": "No Threat Detected",
            "package-name": "com.jktech.mp3tube",
            "price": null,
            "privacyPolicy": null,
            "recent_changes": null,
            "released": null,
            "required_android_version": null,
            "reviews": null,
            "sale": null,
            "saleTime": null,
            "score": null,
            "screenshots": null,
            "size": null,
            "store-availability": [],
            "title": null,
            "updated": null,
            "url": null,
            "video": null,
            "vt_positives": 0,
            "vt_positives_list": []
        }
    ]
}